my_case/case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

deltaT          0.001;

endTime         1.0;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

adjustTimeStep  yes;

maxCo           5.0;

writeFormat     ascii;

writePrecision  15;

runTimeModifiable true;

libs
(
    // Needed for availability of porous baffle boundary in potentialFoam
    #include "turbulenceLib"
);

functions
{
    DESModelRegions1
    {
        type            DESModelRegions;
        libs            ("libfieldFunctionObjects.so");
        enabled         true;
        writeControl    outputTime;
        log             true;
        writeToFile     true;
        resultName      DESRegions;
    }}

// ************************************************************************* //
